[
  {
    "path": "Workshops/GxE-Analysis-with-R/",
    "title": "TARI Bean Program Workshop: GxE Analysis in R",
    "description": "Day x of the TARI Bean Program Training hosted by CIAT Arusha.",
    "author": [
      {
        "name": "Ellena Girma",
        "url": "https://rforplantbreeders.netlify.app/about.html"
      }
    ],
    "date": "2022-05-11",
    "categories": [],
    "contents": "\r\nWelcome\r\nMy name is Ellena Girma and I am a data analyst intern at CIAT Arusha. I will be leading today’s workshop on GxE Interaction and Stability Analysis.\r\nThe goal of this workshop is to give TARI Bean Project scientists and technicians an overview of how to use R to run GxE Interaction and Stability Analysis.\r\n\r\n\r\n\r\n\r\n\r\n\r\nfitvids('.shareagain', {players: 'iframe'});\r\n\r\nMaterials\r\nR\r\nYou will need to install R as well as the following packages:\r\n\r\n\r\n\r\nData\r\nFeel free to use your own data if you have data available. If you need data to practice on, I suggest using data from this paper. 1 The data contains information about the seed yield, 100 seed weight, number of seeds/pod, number of pods/plant and days to 75% flowering for 99 common bean variants grown in 3 locations. The data is listed under Appendix A. Supplementary data.\r\nSlides (pdf format?)\r\n\r\n‘’Philipo M, Ndakidemi PA, Mbega ER. Environmentally stable common bean genotypes for production in different agro-ecological zones of Tanzania. Heliyon. 2021 Jan 19;7(1):e05973. doi: 10.1016/j.heliyon.2021.e05973’’↩︎\r\n",
    "preview": {},
    "last_modified": "2022-05-11T14:48:56+03:00",
    "input_file": "GxE-Analysis-in-R.knit.md"
  },
  {
    "path": "Workshops/2022-03-18-gxe-past-paper-analysis/",
    "title": "GxE Past Paper Summary & Analysis",
    "description": "A summary & analysis of a past paper on GxE Interaction and Stability in Three Agro-ecologies in Tanzania presented this to Dr. Teshale and fellow colleagues Leah, Ombeni, and Anne. .",
    "author": [
      {
        "name": "Ellena Girma",
        "url": "https://rforplantbreeders.netlify.app/about.html"
      }
    ],
    "date": "2022-03-18",
    "categories": [],
    "contents": "\r\nWorkshop 1\r\nTo learn more about GxE Interaction analysis, I picked a paper and did a summary presentation. I chose  Environmentally stable common bean genotypes for production in different agro-ecological zones of Tanzania  as it would give me a good understanding of common bean production and productivity in Tanzania.\r\nHere is the  slide deck  I made for the presentation. I presented this to Dr. Teshale and fellow colleagues Leah, Ombeni, and Anne.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2022-04-13T16:02:13+03:00",
    "input_file": {}
  }
]
